public class Work2 {
    public static void main(String[] args) {
        int a = 5 + 2 / 8; // = 5, тип int только целые числа, 0.25 отбрасывается
        System.out.println("5.1) " + a);
        a = (5 + 2) / 8; //= 0, 7/8 не целое число, дробная часть отбрасыается
        System.out.println("5.2) " + a);
        int e = 2;
        int c = (5 + e++) / 8; //=0, (5+2)/8=0 постфиксную форму увеличиваем после вычисления, дробную часть откидываем
        System.out.println("5.3) " + c);
        int f = 8;
        e = 2;
        int g = (5 + e++) / --f; //=1, (5+2)/7=1, префиксную форму уменьшаем до вычисления
        System.out.println("5.4) " + g);
        f = 8;
        e = 2;
        int d = (5 * 2 >> e++) / --f; //=0, , у сдвига наименьший приоритет, (10>>2)/7=(00001010>>2) / 7 = 00000010 / 7 = 2/7, дробь откидываем
        System.out.println("5.5) " + d);
        e = 2;
        f = 8;
        int m = (5 + 7 > 20 ? 68 : 22 * 2 >> e++) / --f; // =1, 12 > 68?, нет, значит 22*2>>2 = 44 >> 2 = 00101100>>2 = 00001011 = 11; 11/7 = 1
        System.out.println("5.6) " + m);

/*      5.7  (5 + 7 > 20 ? 68 => 68 : 22 * 2 >> 2++) / --8
           не скомпилируется, т.к. справа int, а слева и в середине boolean*/

        boolean v = 6 - 2 > 3 && 12 * 12 <= 119 ; // =false; 4 > 3 && 144 <=119; true && false не равны
        System.out.println("5.8) " + v);
        boolean l = true && false; // не равны
        System.out.println("5.9) " + l);
    }
}